biblioteca_de_filmes/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if MovieService.save(@movie)
---
INSERT INTO "movies" ("title", "description", "release_year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Enim laborum Minus "], ["description", nil], ["release_year", "1989-09-21"], ["created_at", "2024-10-25 00:11:09.956342"], ["updated_at", "2024-10-25 00:11:09.956342"]]

  def update
    respond_to do |format|
      if MovieService.update(@movie, movie_params)
---
UPDATE "movies" SET "description" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["description", "24"], ["updated_at", "2024-10-28 01:03:31.764334"], ["id", 1]]

  def destroy
    MovieService.delete(@movie)
---
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 7]]

  def destroy_photo
    @movie = Movie.find(params[:id])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]