biblioteca_de_filmes/app/services/movie_service.rb

    def save(movie)
      movie.save
---
INSERT INTO "movies" ("title", "description", "release_year", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Enim laborum Minus "], ["description", nil], ["release_year", "1989-09-21"], ["created_at", "2024-10-25 00:11:09.956342"], ["updated_at", "2024-10-25 00:11:09.956342"]]
UPDATE "movies" SET "updated_at" = $1 WHERE "movies"."id" = $2  [["updated_at", "2024-11-02 02:36:35.093288"], ["id", 3]]

    def update(movie, movie_params)
      if movie.update(movie_params.except(:photos))
---
UPDATE "movies" SET "description" = $1, "updated_at" = $2 WHERE "movies"."id" = $3  [["description", "24"], ["updated_at", "2024-10-28 01:03:31.764334"], ["id", 1]]

    def delete(movie)
      movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 3]]